Tutorials1/reactingLagrangianQGDFoam/gasDiffusion/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cell;

setFormat       csv;

sets
(
    line1
    {
        type    face;
        axis    x;
        start   (0 1e-3 0);
        end     (0.499 1e-3 0);
        nPoints 1000;
    }
);

fields          (pMean);


// ************************************************************************* //
